Repository: siwardean/bunbukan
Catalog: languages/*.po
Languages: fr_fr, ja_jp, nl_nl

source: 2nd Dan Shitō-Ryū, Black Belt in Kobudō, Technical Instructor
fr_fr: 2e Dan Shitō-Ryū, ceinture noire en Kobudō, instructeur technique
ja_jp: 糸東流空手弐段・古武道黒帯・技術指導

source: 2nd Dan Shitō-Ryū, Technical Instructor (Karate)
fr_fr: 2e Dan Shitō-Ryū, instructeur technique (Karaté)
ja_jp: 糸東流空手弐段・技術指導（空手）

source: 6th Dan Shitō-Ryū (Shihan), Chief Instructor
fr_fr: 6e Dan Shitō-Ryū (Shihan), instructeur en chef
ja_jp: 糸東流空手六段（師範）・首席指導者

source: About
fr_fr: À propos
ja_jp: について

source: About Bunbukan Brussels
fr_fr: À propos du Bunbukan Brussels
ja_jp: ブリュッセル文武館について
nl_nl: Over Bunbukan Brussels

source: Accept
fr_fr: Accepter
ja_jp: 同意

source: Accept cookies
fr_fr: Accepter les cookies
ja_jp: Cookieを受け入れる

source: Affiliations
ja_jp: 所属団体
nl_nl: Aangesloten organisaties

source: As part of Budo Club Berchem, we preserve and transmit traditional martial arts taught at the Bunbukan Honbu Dōjō, while also continuing the Shitō-ryū karate lineage passed down by Kenei Mabuni.
fr_fr: Au sein du Budo Club Berchem, nous préservons et transmettons les arts martiaux traditionnels enseignés au Bunbukan Honbu Dōjō, tout en perpétuant la lignée du karaté Shitō-ryū transmise par Kenei Mabuni.
ja_jp: 武道クラブ・ベルケムの一員として、文武館本部道場で教える伝統武術を守り伝え、摩文仁賢栄先生から受け継いだ糸東流空手の系譜を継承しています。

source: Assists in both Karate and Kobudō. Special focus on Okinawan weapons training.
fr_fr: Assiste en karaté et en kobudō. Focus particulier sur l'entraînement aux armes okinawaises.
ja_jp: 空手・古武道の両方を補佐。沖縄武器術に特に注力。

source: Assists in Karate instruction. Focused on precise technique and kata understanding.
fr_fr: Assiste à l'enseignement du karaté. Axé sur la technique précise et la compréhension des kata.
ja_jp: 空手指導を補佐。正確な技術と型の理解に重点を置く。

source: Authentic
fr_fr: Authentique
ja_jp: 正統

source: Begin Your Journey
fr_fr: Commencez votre voyage
ja_jp: あなたの旅を始める
nl_nl: Start je reis

source: Bunbukan Brussels
ja_jp: ブリュッセル文武館

source: Bunbukan Brussels heritage
fr_fr: Héritage Bunbukan Brussels
ja_jp: ブリュッセル文武館の伝統

source: Bunbukan logo
fr_fr: Logo Bunbukan
ja_jp: 文武館ロゴ

source: Contact
ja_jp: お問い合わせ

source: Cookie Consent
fr_fr: Consentement aux cookies
ja_jp: Cookie同意

source: Decline
fr_fr: Refuser
ja_jp: 拒否

source: Decline cookies
fr_fr: Refuser les cookies
ja_jp: Cookieを拒否

source: Direct lineage from Kenei Mabuni
fr_fr: Lignée directe de Kenei Mabuni
ja_jp: 摩文仁賢栄先生直系

source: Disciplines
ja_jp: 武道

source: Experienced Instructors
fr_fr: Instructeurs expérimentés
ja_jp: 経験豊富な指導者

source: Follow Us
fr_fr: Suivez-nous
ja_jp: フォロー

source: Footer Menu
fr_fr: Menu du pied de page
ja_jp: フッターメニュー

source: Friday
fr_fr: Vendredi
ja_jp: 金曜日

source: Get in Touch
fr_fr: Nous contacter
ja_jp: お問い合わせ

source: Heritage
fr_fr: Héritage
ja_jp: 伝統

source: Home
fr_fr: Accueil
ja_jp: ホーム

source: Instructors
fr_fr: Instructeurs
ja_jp: 指導者

source: It seems we can&rsquo;t find what you&rsquo;re looking for. Perhaps searching can help.
fr_fr: Nous ne trouvons pas ce que vous cherchez. Une recherche peut vous aider.
ja_jp: お探しの内容が見つかりません。検索をお試しください。

source: Karate
fr_fr: Karaté
ja_jp: 空手

source: Karate & Kobudō
fr_fr: Karaté & Kobudō
ja_jp: 空手道と古武道

source: Karate and kobudō are two sides of the same coin. To understand one, you must practice the other.
fr_fr: Le karaté et le kobudō sont les deux faces d'une même médaille. Pour comprendre l'un, il faut pratiquer l'autre.
ja_jp: 空手と古武道は表裏一体。一方を理解するには、もう一方を稽古する必要があります。

source: Karate training at makiwara
fr_fr: Entraînement de karaté au makiwara
ja_jp: 巻藁での空手稽古

source: Kobudō training at makiwara
fr_fr: Entraînement de kobudō au makiwara
ja_jp: 巻藁での古武道稽古

source: Language switcher
fr_fr: Sélecteur de langue
ja_jp: 言語切り替え
nl_nl: Taalkeuze

source: Location
fr_fr: Adresse
ja_jp: 所在地

source: Mission
ja_jp: 使命

source: New members are always welcome. Come observe a class or join us for a free trial session.
fr_fr: Les nouveaux membres sont toujours les bienvenus. Venez observer un cours ou rejoignez-nous pour une séance d'essai gratuite.
ja_jp: 新規会員はいつでも歓迎です。見学または無料体験にご参加ください。

source: Nothing Found
fr_fr: Rien trouvé
ja_jp: 見つかりませんでした

source: Open to students aged 14 and up. All levels welcome.
fr_fr: Ouvert aux pratiquants à partir de 14 ans. Tous niveaux bienvenus.
ja_jp: 14歳以上対象。初心者から上級者まで歓迎。

source: Our Instructors
fr_fr: Nos instructeurs
ja_jp: 指導者紹介
nl_nl: Onze instructeurs

source: Over 50 years of martial arts experience. Direct student of Kenei Mabuni and Nakamoto Masahiro.
fr_fr: Plus de 50 ans d'expérience en arts martiaux. Élève direct de Kenei Mabuni et Nakamoto Masahiro.
ja_jp: 50年以上の武道経験。摩文仁賢栄・仲本政博両先生の直門。

source: Pages:
ja_jp: ページ：

source: Part of Budo Club Berchem
fr_fr: Membre du Budo Club Berchem
ja_jp: 武道クラブ・ベルケム所属

source: Preserving the authentic traditions of Okinawan martial arts in Brussels
fr_fr: Préserver les traditions authentiques des arts martiaux okinawais à Bruxelles
ja_jp: ブリュッセルで沖縄伝統武術の真髄を守り伝える

source: Primary Menu
fr_fr: Menu principal
ja_jp: メインメニュー

source: Questions about training or want to arrange a visit? We would love to hear from you.
fr_fr: Des questions sur l'entraînement ou souhaitez organiser une visite ? Nous serions ravis de vous répondre.
ja_jp: 稽古についてのご質問や見学のご希望は、お気軽にご連絡ください。

source: Ready to publish your first post? <a href="%1$s">Get started here</a>.
fr_fr: Prêt à publier votre premier article ? <a href="%1$s">Commencez ici</a>.
ja_jp: 最初の投稿を公開する準備はできましたか？<a href="%1$s">ここから始める</a>。

source: Ryūkyū Kobudō
ja_jp: 琉球古武道

source: Ryūkyū Kobudō is the traditional weapon art of Okinawa, practiced alongside karate. At Bunbukan, this discipline develops coordination, control, and body awareness through the study of classical weapon forms and their applications, in an authentic and traditional approach.
fr_fr: Le Ryūkyū Kobudō est l'art traditionnel des armes d'Okinawa, pratiqué aux côtés du karaté. Au Bunbukan, cette discipline développe la coordination, le contrôle et la conscience du corps par l'étude des formes classiques aux armes et de leurs applications, dans une approche authentique et traditionnelle.
ja_jp: 琉球古武道は沖縄の伝統武器術で、空手と並んで稽古されます。文武館では、古典的な武器の型とその応用を正統・伝統的なアプローチで学び、協調性、コントロール、身体感覚を養います。

source: Select language
fr_fr: Choisir la langue
ja_jp: 言語を選択

source: Send Email
fr_fr: Envoyer un e-mail
ja_jp: メールを送信
nl_nl: E-mail sturen

source: Shitō-ryū is a traditional Okinawan karate style, known for the richness of its kata and the precision of its techniques. Rooted in both Shuri and Naha traditions, it offers a complete practice that combines technical rigor, fluid movement, and a deep understanding of martial principles.
fr_fr: Le Shitō-ryū est un style de karaté okinawais traditionnel, reconnu pour la richesse de ses kata et la précision de ses techniques. Enraciné dans les traditions de Shuri et Naha, il offre une pratique complète alliant rigueur technique, fluidité du mouvement et compréhension approfondie des principes martiaux.
ja_jp: 糸東流は沖縄伝統の空手流派で、型の豊かさと技術の精密さで知られています。首里・那覇の両伝統に根ざし、技術の厳密さ、流れるような動き、武術原理の深い理解を兼ね備えた総合的な稽古を提供します。

source: Shitō-Ryū Karate
ja_jp: 糸東流空手

source: Shitō-Ryū Karate logo
fr_fr: Logo Shitō-Ryū Karate
ja_jp: 糸東流空手ロゴ

source: SINCE 1977
fr_fr: DEPUIS 1977
ja_jp: 1977年より

source: Since 1979
fr_fr: Depuis 1979
ja_jp: 1979年より

source: Since 2001
fr_fr: Depuis 2001
ja_jp: 2001年より

source: Skip to content
fr_fr: Aller au contenu
ja_jp: コンテンツへスキップ

source: Sorry, but nothing matched your search terms. Please try again with some different keywords.
fr_fr: Aucun résultat ne correspond à votre recherche. Veuillez réessayer avec d'autres mots-clés.
ja_jp: 検索条件に一致するものが見つかりませんでした。別のキーワードでお試しください。

source: Submit
fr_fr: Envoyer
ja_jp: 送信

source: Technical depth and character development. Respect for tradition while fostering personal growth through the path of martial arts.
fr_fr: Profondeur technique et développement du caractère. Respect de la tradition tout en favorisant l'épanouissement personnel par la voie des arts martiaux.
ja_jp: 技術の深さと人格の育成。伝統を尊重しつつ、武道の道を通じて自己成長を促します。

source: THE WAY
fr_fr: LA VOIE
ja_jp: 道

source: Traditional Okinawan Martial Arts in Brussels
fr_fr: Arts martiaux okinawais traditionnels à Bruxelles
ja_jp: ブリュッセルの沖縄伝統武術
nl_nl: Traditionele Okinawaanse vechtsporten in Brussel

source: Training Schedule
fr_fr: Horaires des entraînements
ja_jp: 稽古スケジュール

source: Under Nakamoto Masahiro
fr_fr: Sous Nakamoto Masahiro
ja_jp: 仲本政博先生に師事

source: View Map
fr_fr: Voir la carte
ja_jp: 地図を見る

source: We use cookies to enhance your browsing experience and remember your language preference. By clicking "Accept", you consent to our use of cookies.
fr_fr: Nous utilisons des cookies pour améliorer votre navigation et mémoriser votre langue. En cliquant sur « Accepter », vous consentez à notre utilisation des cookies.
ja_jp: 閲覧体験の向上と言語設定の記憶のためCookieを使用しています。「同意」をクリックするとCookieの使用に同意したことになります。

source: Wednesday
fr_fr: Mercredi
ja_jp: 水曜日

source: Years Teaching
fr_fr: Années d'enseignement
ja_jp: 指導年数

source: You can choose to practice only one of the two disciplines.
fr_fr: Vous pouvez choisir de ne pratiquer qu'une des deux disciplines.
ja_jp: 空手と古武道のどちらか一方だけの稽古も可能です。

source: All rights reserved.
fr_fr: Tous droits réservés.

source: Our Heritage
nl_nl: Ons erfgoed

source: Our Mission
nl_nl: Onze missie

source: The Dōjō
nl_nl: De Dōjō

source: Interested in Training?
nl_nl: Wil je trainen?

source: Join a Class
nl_nl: Doe mee met een les

source: Contact Us
nl_nl: Contact
